Revit 2027 API
TopographySurface.Create(Document, IList<XYZ>, IList<PolymeshFacet>) Method
Note: This API is now obsolete.
 Creates a new topography surface element from facets and adds it to the document.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[ObsoleteAttribute("This method is deprecated in Revit 2024 with the introduction of the new Toposolid elements.  It is recommended that Toposolid elements should be used in place of TopographySurface elements.")]
public static TopographySurface Create(
	Document document,
	IList<XYZ> points,
	IList<PolymeshFacet> facets
)
<ObsoleteAttribute("This method is deprecated in Revit 2024 with the introduction of the new Toposolid elements.  It is recommended that Toposolid elements should be used in place of TopographySurface elements.")>
Public Shared Function Create (
	document As Document,
	points As IList(Of XYZ),
	facets As IList(Of PolymeshFacet)
) As TopographySurface
public:
[ObsoleteAttribute(L"This method is deprecated in Revit 2024 with the introduction of the new Toposolid elements.  It is recommended that Toposolid elements should be used in place of TopographySurface elements.")]
static TopographySurface^ Create(
	Document^ document,
	IList<XYZ^>^ points,
	IList<PolymeshFacet^>^ facets
)
[<ObsoleteAttribute("This method is deprecated in Revit 2024 with the introduction of the new Toposolid elements.  It is recommended that Toposolid elements should be used in place of TopographySurface elements.")>]
static member Create :
        document : Document *
        points : IList<XYZ> *
        facets : IList<PolymeshFacet> -> TopographySurface
Parameters
document Document
 The document to be modified.
points IList<XYZ>
 A collection of points. The points represent an enclosed area in the XY plane.
facets IList<PolymeshFacet>
 Triangle facets composing a polygon mesh. Every facet contains 3 integers representing vertex indices.
Return Value
TopographySurface
 The new topography surface.
Exceptions
Exception | Condition
ArgumentException |  document is not a project document. -or- There are invalid facets. Facets with more than two points with same x, y are not allowed. -or- There is(are) reference gap(s) between input arguments: points and facets.
ArgumentNullException |  A non-optional argument was null
ModificationForbiddenException |  The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- The document is being loaded, or is in the midst of another sensitive process.
ModificationOutsideTransactionException |  The document has no open transaction.
Remarks
 The document will be regenerated during the creation of this topography surface element. The topography surface created by facet cannot modify its triangle points and facets.
See Also
Reference
TopographySurface Class
Create Overload
Autodesk.Revit.DB.Architecture Namespace